Revit 2025 API
TrussCurveType Enumeration
Types of curves created in truss families.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum TrussCurveType
Public Enumeration TrussCurveType
public enum class TrussCurveType
type TrussCurveType
Members
Member name | Value | Description
NonTrussCurve | 0
TopChord | 1
BottomChord | 2
Web | 3
See Also
Reference
Autodesk.Revit.DB.Structure Namespace